//
//  Condition.h
//  Homework 02
//
//  Created by Ralitsa Toneva on 15.02.24.
//

// Да се реализира интерфейс Serializeable, който съдържа следните методи:
//serialize - сериализира класа от подадения файлов поток в двоичен формат;
//deserialize - десериализира класа от подадения файлов поток в двоичен формат.

//Да се реализира клас Movie, представляващ филм, който съдържа заглавие (до 100 символа), име на
//директор (до 100 символа), година на излизане, начален час (представен като структура с час и
//минути) и продължителност (брой минути). Класът да имплементира интерфейса Serializeable. Да се
//реализират необходимите конструктори, селектори и мутатори за класа.

//Да се реализира клас MovieCatalog, който представлява каталог от филми, който, освен списък с
//филми, съдържа и име на киното, за което е каталога, и дата, на която се прожектират филмите от
//каталога (датата да се представи като структура с ден, месец и година). Класът да имплементира
//интерфейса Serializeable. Конструкторът на класа да приема име на двоичен файл, съдържащ информация
//за каталога - ако такъв файл съществува да се зареди информацията за каталога от него, в противен
//случай да се зададат името на киното, което да е същото като името на файла, но без разширението, и
//датата, която да е текущата дата (разгледайте библиотеката <ctime>). При извикване на деструктора
//на класа да се запише информацията за каталога обратно във файла. Да се реализират методи за
//добавяне и премахване на филм от каталога, търсене на филм по име, както и намиране на броя на
//филмите, които се прожектират в даден времеви интервал (филми, които са почнали преди този интервал
//или приключват след него не се броят).



