//
//  Condition.h
//  Shopping_cart
//
//  Created by Ralitsa Toneva on 15.02.24.
//

// Пазарна количка
//Да се реализира клас пазарна количка, който съдържа списък от продукти в количката.
//Всеки продукт съдържа име, цена за брой и количество. Да се реализират нужните
//селектори и мутатори. За продукта да се реализират методи за намиране на общата цена
//и за извеждане на подробна информация за продукта. За количката да се реализират
//методи за добавяне и премахване на продукт, за намиране на общата цена на продуктите
//в количката и за извеждане на подробна информация за количката и продуктите в нея.
//Да се демонстрира коректността на реализацията чрез примерна програма.


