//
//  Condition.h
//  task_01_homework
//
//  Created by Ralitsa Toneva on 13.02.24.
//

//1. Заредете картинка (по ваш избор) на екрана от лявата страна, вертикално центрирана. Картинката трябва да
// започне да се движи надясно докато стигне другия край на прозореца. Когата дясната част на картинката стигне до края на прозореца,
// картинката си сменя посоката и тръгва наляво. Като стигне до проначалното си местоположение всичко се повтаря.
//* (БОНУС ТОЧКИ: скоростта на движение се увеличава докато върви програмата *

